source/RequestSend/test.jmx
<jmeterTestPlan>
	<hashTree>
		<TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
			<boolProp name="TestPlan.functional_mode">false</boolProp>
			<boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
			<boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
			<elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
				<collectionProp name="Arguments.arguments"/>
			</elementProp>
		</TestPlan>
		<hashTree>
			<Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
				<collectionProp name="Arguments.arguments">
					<elementProp name="udv_webapp" elementType="Argument">
						<stringProp name="Argument.name">udv_webapp</stringProp>
						<stringProp name="Argument.value">${__BeanShell( System.getenv("webapp") )}</stringProp>
						<stringProp name="Argument.desc">Web App URL</stringProp>
						<stringProp name="Argument.metadata">=</stringProp>
					</elementProp>
				</collectionProp>
			</Arguments>
			<hashTree/>
			<kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="jp@gc - Ultimate Thread Group" enabled="true">
				<collectionProp name="ultimatethreadgroupdata">
					<collectionProp name="-1108691518">
						<stringProp name="1567">10</stringProp>
						<stringProp name="48">0</stringProp>
						<stringProp name="48873">180</stringProp>
						<stringProp name="49710">240</stringProp>
						<stringProp name="10">5</stringProp>
					</collectionProp>
				</collectionProp>
				<elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
					<boolProp name="LoopController.continue_forever">false</boolProp>
					<intProp name="LoopController.loops">-1</intProp>
				</elementProp>
				<stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
			</kg.apc.jmeter.threads.UltimateThreadGroup>
			<hashTree>
				<kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="jp@gc - Throughput Shaping Timer" enabled="true">
					<collectionProp name="load_profile">
						<collectionProp name="-192758233">
							<stringProp name="1567">10</stringProp>
							<stringProp name="1691">50</stringProp>
							<stringProp name="48873">180</stringProp>
						</collectionProp>
						<collectionProp name="1582355627">
							<stringProp name="1691">50</stringProp>
							<stringProp name="1691">50</stringProp>
							<stringProp name="49710">240</stringProp>
						</collectionProp>
					</collectionProp>
				</kg.apc.jmeter.timers.VariableThroughputTimer>
				<hashTree/>
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="remoteone" enabled="true">
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
						<collectionProp name="Arguments.arguments"/>
					</elementProp>
					<stringProp name="HTTPSampler.domain">${udv_webapp}</stringProp>
					<stringProp name="HTTPSampler.port">80</stringProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">remoteone</stringProp>
					<stringProp name="HTTPSampler.method">GET</stringProp>
					<boolProp name="HTTPSampler.follow_redirects">true</boolProp>
					<boolProp name="HTTPSampler.auto_redirects">false</boolProp>
					<boolProp name="HTTPSampler.use_keepalive">true</boolProp>
					<boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
					<stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
					<stringProp name="HTTPSampler.connect_timeout">60000</stringProp>
					<stringProp name="HTTPSampler.response_timeout">60000</stringProp>
				</HTTPSamplerProxy>
				<hashTree/>
			</hashTree>
			<kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="jp@gc - Ultimate Thread Group" enabled="true">
				<collectionProp name="ultimatethreadgroupdata">
					<collectionProp name="-1108691518">
						<stringProp name="1567">10</stringProp>
						<stringProp name="48">0</stringProp>
						<stringProp name="48873">180</stringProp>
						<stringProp name="49710">240</stringProp>
						<stringProp name="10">5</stringProp>
					</collectionProp>
				</collectionProp>
				<elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
					<boolProp name="LoopController.continue_forever">false</boolProp>
					<intProp name="LoopController.loops">-1</intProp>
				</elementProp>
				<stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
			</kg.apc.jmeter.threads.UltimateThreadGroup>
			<hashTree>
				<kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="jp@gc - Throughput Shaping Timer" enabled="true">
					<collectionProp name="load_profile">
						<collectionProp name="-192758233">
							<stringProp name="1567">10</stringProp>
							<stringProp name="1691">50</stringProp>
							<stringProp name="48873">180</stringProp>
						</collectionProp>
						<collectionProp name="1843477483">
							<stringProp name="1691">50</stringProp>
							<stringProp name="1691">50</stringProp>
							<stringProp name="49710">240</stringProp>
						</collectionProp>
					</collectionProp>
				</kg.apc.jmeter.timers.VariableThroughputTimer>
				<hashTree/>
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="remotetwo" enabled="true">
					<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments">
						<collectionProp name="Arguments.arguments">
							<elementProp name="" elementType="HTTPArgument">
								<boolProp name="HTTPArgument.always_encode">false</boolProp>
								<stringProp name="Argument.value">1</stringProp>
								<stringProp name="Argument.metadata">=</stringProp>
							</elementProp>
						</collectionProp>
					</elementProp>
					<stringProp name="HTTPSampler.domain">${udv_webapp}</stringProp>
					<stringProp name="HTTPSampler.port">80</stringProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">remotetwo</stringProp>
					<stringProp name="HTTPSampler.method">GET</stringProp>
					<boolProp name="HTTPSampler.follow_redirects">true</boolProp>
					<boolProp name="HTTPSampler.auto_redirects">false</boolProp>
					<boolProp name="HTTPSampler.use_keepalive">true</boolProp>
					<boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
					<stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
					<stringProp name="HTTPSampler.connect_timeout">60000</stringProp>
					<stringProp name="HTTPSampler.response_timeout">60000</stringProp>
				</HTTPSamplerProxy>
				<hashTree/>
			</hashTree>
			<kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="jp@gc - Ultimate Thread Group" enabled="true">
				<collectionProp name="ultimatethreadgroupdata">
					<collectionProp name="-1108691518">
						<stringProp name="1567">10</stringProp>
						<stringProp name="48">0</stringProp>
						<stringProp name="48873">180</stringProp>
						<stringProp name="49710">240</stringProp>
						<stringProp name="10">5</stringProp>
					</collectionProp>
				</collectionProp>
				<elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
					<boolProp name="LoopController.continue_forever">false</boolProp>
					<intProp name="LoopController.loops">-1</intProp>
				</elementProp>
				<stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
			</kg.apc.jmeter.threads.UltimateThreadGroup>
			<hashTree>
				<kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="jp@gc - Throughput Shaping Timer" enabled="true">
					<collectionProp name="load_profile">
						<collectionProp name="1543912173">
							<stringProp name="1567">10</stringProp>
							<stringProp name="1691">50</stringProp>
							<stringProp name="48873">180</stringProp>
						</collectionProp>
						<collectionProp name="1582355627">
							<stringProp name="1691">50</stringProp>
							<stringProp name="1691">50</stringProp>
							<stringProp name="49710">240</stringProp>
						</collectionProp>
					</collectionProp>
				</kg.apc.jmeter.timers.VariableThroughputTimer>
				<hashTree/>
				<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="remotethree" enabled="true">
					<elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
						<collectionProp name="Arguments.arguments"/>
					</elementProp>
					<stringProp name="HTTPSampler.domain">${udv_webapp}</stringProp>
					<stringProp name="HTTPSampler.port">80</stringProp>
					<stringProp name="HTTPSampler.protocol">http</stringProp>
					<stringProp name="HTTPSampler.path">remotethree</stringProp>
					<stringProp name="HTTPSampler.method">GET</stringProp>
					<boolProp name="HTTPSampler.follow_redirects">true</boolProp>
					<boolProp name="HTTPSampler.auto_redirects">false</boolProp>
					<boolProp name="HTTPSampler.use_keepalive">true</boolProp>
					<boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
					<stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
					<stringProp name="HTTPSampler.connect_timeout">60000</stringProp>
					<stringProp name="HTTPSampler.response_timeout">60000</stringProp>
				</HTTPSamplerProxy>
				<hashTree/>
			</hashTree>
		</hashTree>
	</hashTree>
</jmeterTestPlan>